# Assignment 1 #

** Import libraries **

In [23]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from numpy import genfromtxt

** Import CSV data into a Pandas dataframe **

In [17]:
df = pd.read_csv("/Users/joanhealy1/Documents/GMIT-semester-2/data-analysis-assignment-1/anscombes-quartet.csv")

In [18]:
df.head()

  id dataset     x     y
0  0       I  10.0  8.04
1  1       I   8.0  6.95
2  2       I  13.0  7.58
3  3       I   9.0  8.81
4  4       I  11.0  8.33

In [19]:
df.tail()

    id dataset     x      y
40  40      IV  19.0  12.50
41  41      IV   8.0   5.56
42  42      IV   8.0   7.91
43  43      IV   8.0   6.89
44   }     NaN   NaN    NaN

In [20]:
df.describe()

               x          y
count  44.000000  44.000000
mean    9.000000   7.500682
std     3.198837   1.958925
min     4.000000   3.100000
25%     7.000000   6.117500
50%     8.000000   7.520000
75%    11.000000   8.747500
max    19.000000  12.740000

In [28]:
sns.pairplot(df, hue="dataset")

In [21]:
df.mean()

x    9.000000
y    7.500682
dtype: float64

In [29]:
my_data = genfromtxt('/Users/joanhealy1/Documents/GMIT-semester-2/data-analysis-assignment-1/anscombes-quartet.csv', delimiter=',')

In [30]:
print(my_data)

[[   nan    nan    nan    nan]
 [  0.      nan  10.     8.04]
 [  1.      nan   8.     6.95]
 [  2.      nan  13.     7.58]
 [  3.      nan   9.     8.81]
 [  4.      nan  11.     8.33]
 [  5.      nan  14.     9.96]
 [  6.      nan   6.     7.24]
 [  7.      nan   4.     4.26]
 [  8.      nan  12.    10.84]
 [  9.      nan   7.     4.82]
 [ 10.      nan   5.     5.68]
 [ 11.      nan  10.     9.14]
 [ 12.      nan   8.     8.14]
 [ 13.      nan  13.     8.74]
 [ 14.      nan   9.     8.77]
 [ 15.      nan  11.     9.26]
 [ 16.      nan  14.     8.1 ]
 [ 17.      nan   6.     6.13]
 [ 18.      nan   4.     3.1 ]
 [ 19.      nan  12.     9.13]
 [ 20.      nan   7.     7.26]
 [ 21.      nan   5.     4.74]
 [ 22.      nan  10.     7.46]
 [ 23.      nan   8.     6.77]
 [ 24.      nan  13.    12.74]
 [ 25.      nan   9.     7.11]
 [ 26.      nan  11.     7.81]
 [ 27.      nan  14.     8.84]
 [ 28.      nan   6.     6.08]
 [ 29.      nan   4.     5.39]
 [ 30.      nan  12.     8.15]
 [ 31.      nan   7.     6.42]
 [ 32.      nan   5.     5.73]
 [ 33.      nan   8.     6.58]
 [ 34.      nan   8.     5.76]
 [ 35.      nan   8.     7.71]
 [ 36.      nan   8.     8.84]
 [ 37.      nan   8.     8.47]
 [ 38.      nan   8.     7.04]
 [ 39.      nan   8.     5.25]
 [ 40.      nan  19.    12.5 ]
 [ 41.      nan   8.     5.56]
 [ 42.      nan   8.     7.91]
 [ 43.      nan   8.     6.89]
 [   nan    nan    nan    nan]]